{
  "session-zero": {
    "sessionNumber": 1,
    "sessionDate": "2025-12-21",
    "campaignId": "flamingos-shadow-test-01",
    "title": "A Night at the Golden Nugget",
    "sessionNotesPreface": "We are introduced to our adventurers: Holden Green and Rosemary Alderwood. It's another night at the Golden Nugget casino, and the audience is strewn about the one-armed bandits and blackjack tables. Rosemary starts her first shift, running about and following a variety of orders from the staff. Holden prepares for just another night to provide a spectacular show to their guests! As quips draw the crowd near, an unsuspecting member of the crowd is brought up to the stage for what could be a deadly night.",
    "sessionNotesCombat": "The show is moving along spectacularly, that is, until a mischievous imp appears out of nowhere. This doesn't appear to be a problem for Holden, though; something draws his aim directly towards where the imp was going to appear. Even before Holden himself knew what was going on...As the Hellfire Imp begins to advance, Holden keeps it at bay while trying to discern if this is some part of the show. The guests and management seem to do the same. Rosemary keeps an eye on the stage, unsure of herself - and after no one can discern who did this, no more punches are held. That Hellfire Imp is turned into a pincushion by The Magnificent Green Blade, while the new employee, Rosemary, gets her first taste of city life!",
    "sessionNotesEnd": "With the show having come to a close, Brandon, Tucker, and Ebbers tell the two adventurers that seeing them go against the Damned Minion was impressive. They have been looking for a pair of employees who could get a special job done. Tuck tells them that his connections have heard there are strange goings-on with the mass migration of people out to the city and all the new construction along the Las Vegas strip. They want the two of them to meet them in owner's office bright and early.",
    "playerIds": [
      "holden-green",
      "rosemary-alderwood"
    ],
    "npcsMet": [
      {
        "id": "brandon",
        "name": "Brandon",
        "description": "Golden Nugget staff member, part of the management team",
        "affiliation": "Golden Nugget Casino",
        "disposition": "friendly",
        "firstAppearance": true
      },
      {
        "id": "tucker",
        "name": "Tucker (Tuck)",
        "description": "Golden Nugget insider with connections to street-level information",
        "affiliation": "Golden Nugget Casino",
        "disposition": "friendly",
        "firstAppearance": true
      },
      {
        "id": "ebbers",
        "name": "Ebbers",
        "description": "Golden Nugget employee and driver for special operations",
        "affiliation": "Golden Nugget Casino",
        "disposition": "friendly",
        "firstAppearance": true
      }
    ],
    "locationsVisited": [
      {
        "id": "golden-nugget",
        "name": "The Golden Nugget",
        "description": "A classic Las Vegas casino with a theater stage and gambling floor",
        "type": "casino",
        "region": "Downtown Las Vegas",
        "firstVisit": true
      }
    ],
    "experienceGained": 100
  },
  "session-one": {
    "sessionNumber": 2,
    "sessionDate": "2026-01-04",
    "campaignId": "flamingos-shadow-test-01",
    "title": "The Flamingo's Welcome",
    "sessionNotesPreface": "Holden and Rosemary begin their day bright and early in the owner's office of the Golden Nugget. Though they had seen Guy McAfee before, the gangster turned president of a public corporation was rarely on the casino floor. He looked over the two employees incredulously. Were these the two who were going to spy on the new casino being built down the street? They sure were! Tuck and Ebbers vouched for their abilities, and the two adventurers were given quite a boon of items to gear up with. As they prepared to leave the establishment, Holden discovered that the Golden Nugget hadn't been doing too well recently, with the murmurings of a new age of decadence to soon hit the city spreading. Their books were a bit short, but nothing they haven't overcome before, right? Once they were prepared, Ebbers drove them under the guise of two hires from various casinos that Guy and Blake had worked with, and wanted to help out the newcomers. Rosemary and Holden had a chance to explore the not yet opened casino as they prepared for opening night, getting lucky with slot machines before feeling a bit famished and deciding to head to the dining hall.",
    "sessionNotesCombat": "When they first entered, the grandiose architecture and high-strung chandeliers seemed much too fancy for two people who were used to a wooden stage and tables. This was a new luxury that the city wasn't yet accustomed to, and there seemed to be some eyes on the newcomers as they found their seats. Collins, one of the many Eastern Syndicate members who followed Benjamin Siegel to the west, had called upon a disguised minion to keep watch over them while a few tormented spirits attempted to communicate. Rosemary seemed entirely unfazed as they took the visage of her brother, and the continued insults she lobbed its way broke its disguise, and the battle was on. Holden was drawn to the Hellfire Imp as his mind was still filled with the assault he faced the night prior, and Rosemary was content to break the tormented wraith that dared to take on the image of someone she loved. As they both dealt with their independent foes, Collins very slowly became worried about whether he could pull off any kind of attack on these two heroes. He made way to the cellar for a note that contained the transcript of a conversation Meyer Lansky had, giving orders to take out Bugsy. Now Rosemary had it. That wasn't all, though, as Holden used a mix of the Chandeliers and his trusty thrown weapons to take down the remaining foes; he cut off any escape route that Collins would have hoped to use, and they could get any information they needed.",
    "sessionNotesEnd": "The party didn't have much more chance to speak with Collins as the management group at the Flamingo walked into the now destroyed dining hall. They escorted the remaining survivors out and Collins was immediately suspected of being the cause for the distress. The few guests who had been allowed entry were cleared out and guards were placed along the doors. Benjamin had the staff push the blackjack tables together and ordered Collins, Rosemary, and Holden to have a seat so they could talk about what had just transpired in his new Dining Hall.",
    "playerIds": [
      "holden-green",
      "rosemary-alderwood"
    ],
    "npcsMet": [
      {
        "id": "guy-mcafee",
        "name": "Guy McAfee",
        "description": "Former gangster, now president of the Golden Nugget corporation",
        "affiliation": "Golden Nugget Casino",
        "disposition": "friendly",
        "firstAppearance": true
      },
      {
        "id": "collins",
        "name": "Collins",
        "description": "Eastern Syndicate member who followed Benjamin Siegel west, now suspected traitor",
        "affiliation": "Eastern Syndicate / Flamingo",
        "disposition": "hostile",
        "firstAppearance": true
      },
      {
        "id": "benjamin-siegel",
        "name": "Benjamin 'Bugsy' Siegel",
        "description": "Notorious gangster and owner of the Flamingo Hotel, known to fly off the handle",
        "affiliation": "Flamingo Hotel",
        "disposition": "neutral",
        "firstAppearance": true
      },
      {
        "id": "meyer-lansky",
        "name": "Meyer Lansky",
        "description": "Eastern mob boss, mentioned in transcript ordering Bugsy's elimination",
        "affiliation": "Eastern Syndicate",
        "disposition": "unknown",
        "firstAppearance": true
      }
    ],
    "locationsVisited": [
      {
        "id": "golden-nugget-office",
        "name": "Golden Nugget Owner's Office",
        "description": "Guy McAfee's private office above the casino floor",
        "type": "business",
        "region": "Downtown Las Vegas",
        "firstVisit": true
      },
      {
        "id": "flamingo-hotel",
        "name": "The Flamingo Hotel",
        "description": "Lavish new casino being built on the Las Vegas Strip, not yet open to the public",
        "type": "hotel",
        "region": "Las Vegas Strip",
        "firstVisit": true
      },
      {
        "id": "flamingo-dining-hall",
        "name": "Flamingo Dining Hall",
        "description": "Grandiose dining area with high-strung chandeliers and luxury decor",
        "type": "restaurant",
        "region": "Las Vegas Strip",
        "firstVisit": true
      }
    ],
    "experienceGained": 200
  },
  "session-two": {
    "sessionNumber": 3,
    "sessionDate": "2026-01-11",
    "campaignId": "flamingos-shadow-test-01",
    "title": "The King's Performance",
    "sessionNotesPreface": "The table had been quiet when the meeting began. Benjamin Siegel, often called Bugsy behind his back for his inclination to fly off the handle and bug out, had asked calmly why Collins had chose to treat the new employees who were offering their time and expertise to the Flamingo in such a way. Collins tried to suggest that they had ill intentions for Mr. Siegel, and that he was the only one trying to look after him. Bugsy apologized for the young manager's actions and assured the two of them that he would be getting cleaned up via a concrete bath for attacking them. The two of them were given some extra time to explore the gambling hall and played a bit of blackjack. Rosemary put down 2 dollars that she almost doubled before the dealer hit 21 on the final hand. After a bit of gambling, Holden decided it was time to begin preparations for his shift in the theater and decided to take the side entrance. As the party entered, they became privy to something above in the vents, and Holden was able to access visions of the near future, much like when he was performing on stage at the Golden Nugget. Was the power of these visions enhanced near these performing areas? There wasn't much time, and Rosemary and Holden quickly shared what they could while they prepared for Elvis to take the stage!",
    "sessionNotesCombat": "Before combat even really started, Holden had acquired the Hellfire Imp's construct, where its spirit was held until summoned by the holder of its contract. Rosemary had activated her earthly magic senses to get a gauge on where the Lunar Moths were in relation to Elvis and themselves as they waited for things to get rolling. Rosemary was the first to start the fight by swinging her meteor hammer directly into the Lunar Moths that were keeping an eye over the King himself, acting as false spotlights for him as he performed for the audience. Holden kept toward stage right to handle the Lunar Moth, who had been attracted to a chest that he propped open just slightly enough to keep the Moth in place but drawn towards the general area. Holden began to fill the moth with his trusty throwing weapons, quickly draining its health until dealt with. Rosemary kept the group of moths busy with her hammer until Holden was able to join the fray. As both adventurers took down the group of moths, they thought they were done. Rosemary noticed someone from the crowd had started to run towards the construct. She stopped him from escaping and tried to knock him out by hitting him in the head with the construct he was chasing towards. The construct had been slightly damaged with all the movement and was shattered across his head. The familiar Hellfire Imp that attacked Holden last night was back! Three members of the Flamingo: Derrin, Tyson, and Pinton had joined in the fray and became a firing squad that executed the imp while Holden heard the pleas of the stranger. He found that someone he competed for a job for, and had gotten the position over, felt like Holden was the reason that his failures were compounding amongst themselves. Holden didn't understand why the stranger felt this way, but the Hellfire Imp seemed to spur him into continuing the fight rather than giving up. It didn't take long to finish them both off. Derrin could see that Rosemary and Holden were combatants who could really hold themselves, and offered them to join him in Benjamin Siegel's office.",
    "sessionNotesEnd": "Holden and Rosemary once more found themselves in the office of a gangster turned hotel owner. Bugsy was impressed, they protected The King, exposed that his boss out east wanted him gone, and all in one shift! He wanted them to go and see about an LDS church near an old Mormon Fort out in the desert. He heard from his crew out in the streets that they were keeping a close eye on him, and he wants to know what they want and what they know. Keeping up the front, the two heroes agree to the job, and as they began to walk out, they were greeted by Ebbers from the Golden Nugget, telling them to get in the car so they could debrief him on what happened. He seemed worried; had he seen the show?",
    "playerIds": [
      "holden-green",
      "rosemary-alderwood"
    ],
    "npcsMet": [
      {
        "id": "elvis-presley",
        "name": "Elvis Presley",
        "description": "The King of Rock and Roll, performing at the Flamingo",
        "affiliation": "Flamingo Hotel",
        "disposition": "friendly",
        "firstAppearance": true
      },
      {
        "id": "derrin",
        "name": "Derrin",
        "description": "Flamingo security member, skilled with firearms",
        "affiliation": "Flamingo Hotel",
        "disposition": "friendly",
        "firstAppearance": true
      },
      {
        "id": "tyson",
        "name": "Tyson",
        "description": "Flamingo security member",
        "affiliation": "Flamingo Hotel",
        "disposition": "friendly",
        "firstAppearance": true
      },
      {
        "id": "pinton",
        "name": "Pinton",
        "description": "Flamingo security member",
        "affiliation": "Flamingo Hotel",
        "disposition": "friendly",
        "firstAppearance": true
      },
      {
        "id": "mysterious-stranger",
        "name": "The Mysterious Stranger",
        "description": "Someone from Holden's past who lost a job to him, now consumed by resentment and bound to a Hellfire Imp",
        "affiliation": "Unknown",
        "disposition": "hostile",
        "firstAppearance": true
      }
    ],
    "locationsVisited": [
      {
        "id": "flamingo-gambling-hall",
        "name": "Flamingo Gambling Hall",
        "description": "The main casino floor with blackjack tables and slot machines",
        "type": "casino",
        "region": "Las Vegas Strip",
        "firstVisit": true
      },
      {
        "id": "flamingo-theater",
        "name": "Flamingo Theater",
        "description": "Performance venue where Elvis performs, with hidden vents above the stage",
        "type": "casino",
        "region": "Las Vegas Strip",
        "firstVisit": true
      },
      {
        "id": "bugsy-office",
        "name": "Bugsy's Office",
        "description": "Benjamin Siegel's private office at the Flamingo",
        "type": "business",
        "region": "Las Vegas Strip",
        "firstVisit": true
      }
    ],
    "experienceGained": 300
  },
  "session-three": {
    "sessionNumber": 4,
    "sessionDate": "2026-01-18",
    "campaignId": "flamingos-shadow-test-01",
    "title": "The Mormon Fort",
    "sessionNotesPreface": "[Placeholder]",
    "sessionNotesCombat": "[Placeholder]",
    "sessionNotesEnd": "[Placeholder]",
    "playerIds": [
      "holden-green",
      "rosemary-alderwood"
    ],
    "npcsMet": [],
    "locationsVisited": [],
    "experienceGained": 0
  }
}